Revit 2027 API
ScheduleDefinition.CanFilterBySubstring Method
 Checks whether a field can be used with a substring-based filter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanFilterBySubstring(
	ScheduleFieldId fieldId
)
Public Function CanFilterBySubstring (
	fieldId As ScheduleFieldId
) As Boolean
public:
bool CanFilterBySubstring(
	ScheduleFieldId^ fieldId
)
member CanFilterBySubstring :
        fieldId : ScheduleFieldId -> bool
Parameters
fieldId ScheduleFieldId
 The ID of the field to check.
Return Value
Boolean
 True if the field can be used with a substring-based filter, false otherwise.
Exceptions
Exception | Condition
ArgumentException |  fieldId is not the ID of a field in this ScheduleDefinition.
ArgumentNullException |  A non-optional argument was null
Remarks
The substring-based filter types are Contains, NotContains, BeginsWith, NonBeginsWith, EndsWith and NotEndsWith.
Only string parameters can be filtered by substring.
See Also
Reference
ScheduleDefinition Class
Autodesk.Revit.DB Namespace